[
    {
      "name": "Black Ops 6 Season 01 Patch Notes Nov 19",
      "image": "https://gbn-api.pages.dev/images/BO6-SEASON-01-PATCH-NOTES.jpg",
      "date": "November 19, 2024",
      "details": {
        "description": "First real article. This article is about everything new with the patch notes for Black Ops 6 on November 19, 2024.",
        "content": [
          {
            "type": "paragraph",
            "text": "On November 19th, 2024 the developers of Black Ops 6: Treyarch released a patch for BO6 regarding the UI and movement. The patch notes go as follows below for the article."
          },
          {
            "type": "image",
            "url": "https://gbn-api.pages.dev/images/COD-BO6-S0-ANNOUNCEMENT-002.jpg",
            "caption": "Announcement image for the patch notes."
          },
          {
            "type": "paragraph",
            "text": "Below is the patch notes for November 19, 2024 updates will change."
          },
          {
            "type": "header",
            "text": "Global"
          },
          {
            "type": "paragraph",
            "text": "Reduced the minimum sprint time required to perform the following actions: dive-to-prone or slide."
          },
          {
            "type": "paragraph",
            "text": "Addressed an issue that could result in being unable to sprint when performing several actions within a short amount of time."
          },
          {
            "type":"header",
            "text":"Multiplayer / Movement"
          },
          {
            "type":"paragraph",
            "text": "Players will no longer be taken out of sprint when taking forward-facing bullet damage with a Melee weapon equipped."
          },
          {
            "type":"header",
            "text": "Zombies / Maps"
          },
          {
            "type":"paragraph",
            "text":"Terminus: Addressed an issue where zombies could spawn indefinitely."
          },
          {
            "type":"paragraph",
            "text": "Liberty Falls: Addressed an issue where players would not be removed from a Chopper Gunner when starting the Main Quest Final Encounter."
          },
          {
            "type":"paragraph",
            "text": "Directed Mode"
          }
        ]
      }
    },
    {
        "name": "Eminem Takes Over The Island in Fortnite Remix",
        "image": "https://gbn-api.pages.dev/images/fortnite-chapter-2-remix-eminem-1920x1080.jpg",
        "date": "November 7, 2024",
        "details":{
            "description": "This article talks about how Eminem take over the grotto in Fortnite Remix and also talks about everything new with this new update.",
            "content": [
                {
                    "type": "paragraph",
                    "text": "Fortnite Remix's new update is here is everything new about this updated added."
                }
            ]
        }
    },
    {
        "name": "Black Ops 6 Season 01 Official Announcement",
        "image": "https://gbn-api.pages.dev/images/BO6-SEASON-01-ANNOUNCEMENT-001.jpg",
        "date": "November 7, 2024",
        "details":{
            "description": "This article talks about the official announcement of Black Ops 6 Season 01.",
            "content": "Call of Duty: Black Ops 6 Season is almost upon us. Here is everything you need to know about Black Ops 6 Season 01."
        }
    },
    {
        "name": "Sony Shuts Down Firewalk Studios After Terrible Release",
        "image": "https://gbn-api.pages.dev/images/concord-central-art.jpg",
        "date": "November 6, 2024",
        "details":{
            "description": "This article talks about how Sony shutdown a game studio after a very bad game launch.",
            "content": "Sony has decided to shut down Firewalk Studios after a horrible game release by the name of Concord that costed $40 on the PS5 Store. The release was very bad and only stayed around for two weeks, the official IGN account gave the game a 7 out of 10."
        }
    },
    {
        "name": "CoD BO6 Season 1 Everything we Know",
        "image": "https://gbn-api.pages.dev/images/COD-BO6-COD-101-TOUT.jpg",
        "date": "November 5, 2024",
        "details":{
            "description": "This article talks about Call of Duty: Black Ops 6 Season 01 coming soon and showing everything known coming up on November 14th.",
            "content": "Call of Duty: Black Ops 6 is coming here is everything we know."
        }
    },
    
    {
        "name": "Call of Duty: Black Ops 6 Releases Nuketown",
        "image": "https://gbn-api.pages.dev/images/COD-BO6-S0-ANNOUNCEMENT-002.jpg",
        "date": "November 1, 2024",
        "details":{
            "description": "This article talks about Call of Duty: Black Ops 6 devs Treyarch released Nuketown and how players love the remastered design.",
            "content": "Treyarch releases Nuketown in Call of Duty: Black Ops 6."
        }
    },

    {
        "name": "Fortnite Reveals Ice Spice & Players Aren't Happy",
        "image": "https://gbn-api.pages.dev/images/fortnite-chapter-2-remix-ice-spice-1920x1080.jpg",
        "date": "November 1, 2024",
        "details":{
            "description": "This article talks about when Fortnite revealed celebrities such as Ice Spice, Snoop Dogg, and Eminem and how're they taking over point-of-interest's instead of the og chapter 2 versions.",
            "content": "Players are not happy with Ice Spice and other rappers taking over the island."
        }
    }
]
  